KanatERPSukhova.КанатАдаптация/src/Catalogs/КАНАТ_ГрупповыеУпаковки/КАНАТ_ГрупповыеУпаковки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КАНАТ_ГрупповыеУпаковки</name>
  <attributes>
    <name>ВесБрутто</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Поддон</name>
    <type>
      <types>CatalogRef.КАНАТ_Поддон</types>
    </type>
  </attributes>
</mdclass:Catalog>

KanatERPSukhova.КанатАдаптация/src/Catalogs/КАНАТ_ГрупповыеУпаковки/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//БИТ_Гурьев_ЧТЗ_2_16_17.05.24++
	ОбновитьОтображениеФормы();
	//БИТ_Гурьев_ЧТЗ_2_16_17.05.24--
КонецПроцедуры

//БИТ_Гурьев_ЧТЗ_2.16_17.05.24++
&НаСервере
Процедура ОбновитьОтображениеФормы()
	
	Если ЗначениеЗаполнено(Объект.ВесБрутто) Тогда
		Элементы.ГруппаДанныеПоддона.Доступность = Ложь;
	Иначе
		Элементы.ГруппаДанныеПоддона.Доступность = Истина;
	КонецЕсли;
	
	ЗаполнитьТипЗаполнения();
	
КонецПроцедуры //БИТ_Гурьев_ЧТЗ_2.16_17.05.24--

//БИТ_Гурьев_ЧТЗ_2.16_17.05.24++
&НаСервере
Процедура ЗаполнитьТипЗаполнения()
	
	Если Не ЗначениеЗаполнено(Объект.Поддон) Тогда
		ТипЗаполнения = Перечисления.КАНАТ_ТипЗаполненияГрупповойУпаковки.ПустаяСсылка();
	Иначе
		ТипЗаполнения = Справочники.КАНАТ_ГрупповыеУпаковки.ПолучитьТипЗаполнения(Объект.Ссылка, Объект.Поддон);
	КонецЕсли;
	
КонецПроцедуры //БИТ_Гурьев_ЧТЗ_2.16_17.05.24--


&НаСервере
Процедура ВесБруттоПриИзмененииНаСервере()
	//БИТ_Гурьев_ЧТЗ_2.16_17.05.24++
	Если ЗначениеЗаполнено(Объект.ВесБрутто) Тогда
		Объект.Поддон = Справочники.КАНАТ_Поддон.ПустаяСсылка();
	КонецЕсли;
	ОбновитьОтображениеФормы();
	//БИТ_Гурьев_ЧТЗ_2.16_17.05.24--
КонецПроцедуры


&НаКлиенте
Процедура ВесБруттоПриИзменении(Элемент)
	ВесБруттоПриИзмененииНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура ВесПоддонаПриИзменении(Элемент)
	ОбновитьОтображениеФормы();
КонецПроцедуры
